## 판다스 (pandas)
데이터를 관리하기 위해 사용되는 모듈로, 시리즈와 데이터프레임을 제공함

In [1]:
# 모듈 가져오기
# 넘파이 모듈을 np라는 이름으로 사용
import numpy as np
# 판다스 모듈을 pd라는 이름으로 사용
import pandas as pd

### 4.1 시리즈 (Series)
객체를 담을 수 있는 1차원 배열 같은 자료 구조

### 시리즈 생성1

In [ ]:
# 시리즈 생성
s = pd.Series([1,2,3,4])
# 왼쪽은 인덱스, 오른쪽은 값
s
# 인덱스 확인
# 인덱스가 없으면 자동으로 설정됨
s.index

## (1)  
숫자 데이터를 시리즈로 만들어 주세요  
값은 [5,10,15,20] 이고, 인덱스는 자동으로 생성됩니다

숫자 데이터를 시리즈로 만들어 주세요.
값은 [2,4,6,8] 이고 , 인덱스는 자동으로 생성됩니다

In [12]:
import pandas as pd

In [13]:
s = pd.Series([5,10,15,20])
s

0     5
1    10
2    15
3    20
dtype: int64

## 시리즈 생성2

In [15]:
#인덱스를 직접 설정하여 시리즈 생성
#pd.Series([값목록],인덱스)
s = pd.Series([1,2,3],index=['a', 'b' ,'c'])
s

a    1
b    2
c    3
dtype: int64

In [13]:
#인덱스 확인
s.index

Index(['a', 'b', 'c'], dtype='object')

## 시리즈에서 값 꺼내기
값을 찾는 방법 : 인덱스의 이름과 위치  
loc 함수 : 인덱스 이름으로 데이터를 찾는다  
iloc 함수 : 인덱스 위치로 데이터를 찾는다  
대괄호[] : 인덱스 이름으로 데이터를 찾는다

In [22]:
print(s)
# 이 시리즈의 인덱스 이름 : a, b, c
# 이 시리지의 인덱스 위치 : 0, 1, 2(고민할 필요 없음)
s.loc ['a']
# => np.int64(1)

#인덱스 이름으로 숫자 2꺼내기
s['b']
# => np.int64(2)

#인덱스 위치로 숫자 3 꺼내기
s.iloc[2]
# => np.int64(3)

a    1
b    2
c    3
dtype: int64

np.int64(3)

## 시리즈 값 수정하기

In [28]:
print(s)
# 1을 0으로 변경
# 찾기 -> 변경
# s.loc['a'] = 0

#3을 99로 변경
s['c'] = 99
s

a     0
b     2
c    99
dtype: int64

a     0
b     2
c    99
dtype: int64

## (2번)
성적 데이터를 시리즈로 만들어주세요.
값은 점수 [70, 80, 90] 이고, 인덱스는 과목 ['국어', '영어', '수학'] 입니다.

1. 국어 점수를 조회하세요. (결과: 70점)
2. 수학 점수를 75점으로 수정하세요.

In [33]:
s = pd.Series([70,80,90],index=['국어', '영어' ,'수학'])
s

국어    70
영어    80
수학    90
dtype: int64

In [35]:
s.loc['국어']

np.int64(70)

In [36]:
s.loc['수학'] = 75

In [37]:
s

국어    70
영어    80
수학    75
dtype: int64

## (3번)
계절별 평균 기온 데이터를 시리즈로 만들어주세요.
값은 기온 [15, 27, 18] 이고, 인덱스는 계절 ['봄', '여름', '가을'] 입니다.

1. 봄 기온을 조회하세요. (결과: 15)
2. 가을 기온을 20으로 수정하세요.

In [38]:
s = pd.Series([15,27,18],index=['봄', '여름' ,'가을'])
s

봄     15
여름    27
가을    18
dtype: int64

In [39]:
s.loc['봄']

np.int64(15)

In [40]:
s.loc['가을'] = 20
s

봄     15
여름    27
가을    20
dtype: int64

## (4번)
일별 매출 데이터를 시리즈로 만들어주세요.
값은 매출 [1000, 1200, 1300] 이고, 인덱스는 날짜 ['01-01', '01-02', '01-03'] 입니다.

1. 1월 1일 매출을 조회하세요. (결과: 1000)
2. 1월 2일 매출을 1250으로 수정하세요.

In [41]:
s = pd.Series([1000,1200,1300],index=['01-01', '01-02' ,'01-03'])
s

01-01    1000
01-02    1200
01-03    1300
dtype: int64

In [42]:
s.loc['01-01']

np.int64(1000)

In [45]:
s.loc['01-02'] = 1250
s

01-01    1000
01-02    1250
01-03    1300
dtype: int64

## (5번)
요일별 매출 데이터를 시리즈로 만들어주세요.
값은 매출 [300, 400, 500] 이고, 인덱스는 요일 ['월', '화', '수'] 입니다.

1. 화요일 매출을 조회하세요. (결과: 400)
2. 수요일 매출을 550으로 수정하세요.

In [48]:
s = pd.Series([300,400,500],index=['월', '화' ,'수'])
s

월    300
화    400
수    500
dtype: int64

In [49]:
s.loc['화']

np.int64(400)

In [50]:
s.loc['수'] = 550
s

월    300
화    400
수    550
dtype: int64

## 4.2 데이터 프레임 (data frame)
<small>표 형식의 2차원 데이터를 담기 위한 자료구조</small>

데이터 프레임 생성1

In [5]:
#도시별 인구 데이터를 담은 데이터 프레임 생성
# 데이터 먼저 만들기(dic)
data = {'city' : ['서울','인천'], 
        'pop' : [990,240]
       }
# city, pop 열 두개를 담은 데이터 프레임 생성
# pd.DataFrame(값, [인덱스],[컬럼])
df = pd.DataFrame(data)
df

# 행열의 이름을 따로 설정하지 않으면 자동으로 설정됨
print(df.index) # 행 이름 : 0,1
print(df.columns) # 열 이름 : dic의 key(city, pop)

RangeIndex(start=0, stop=2, step=1)
Index(['city', 'pop'], dtype='object')

### (1번)
학생 성적 데이터를 데이터프레임으로 만들어주세요.
첫 번째 열은 학생 이름: ["철수", "영희", "민수"]
두 번째 열은 수학 점수: [85, 90, 78]

요일별 매출 데이터를 데이터프레임으로 만들어주세요.
첫 번째 열은 요일: ["월", "화", "수"]
두 번째 열은 매출: [1000, 1200, 900]

In [11]:
# 학생 성적 데이터를 데이터 프레임으로 만들기
data = {'name':['철수','영희','민수'], 
        'math' : [85,90,78]}
df = pd.DataFrame(data)
df

  name  math
0   철수    85
1   영희    90
2   민수    78

In [12]:
# 요일별 매출 데이터를 데이터 프레임으로 만들기
data = {'day' : ['월','화','수'],
        'sales' : [1000,1200,900]}
df = pd.DataFrame(data)
df

  day  sales
0   월   1000
1   화   1200
2   수    900

## 데이터 프레임 생성2

In [20]:
# 학생 성적 데이터 만들기
# dic, listm
# 넘파이의 다차원 배열 사용하여 2차원 배열 생성
data = np.array([ [60,70,80],[70,80,90],[80,90,100] ])
data
# 성적 데이터를 담아서 데이터 프레임 생성
df = pd.DataFrame(data)
df

# => 이 점수가 누구의 어떤 점수인지 알기 위해, 이름표 붙이기
# 행 이름 : 학생의 이름
# 열 이름 : 과목명
df = pd.DataFrame(data, 
                  index=['둘리','또치','도우너'],
                  columns=['국어','영어','수학'])
df

# 행 인덱스
df.index # =>['둘리', '또치', '도우너']
# 열 컬럼
df.columns # =>['국어', '영어', '수학']

Index(['국어', '영어', '수학'], dtype='object')

## 데이터 프레임에서 데이터 꺼내기
loc : 행, 열 이름으로 데이터를 꺼낸다  
iloc : 행, 열 위치로 데이터를 꺼낸다  
[] : 행, 열 이름으로 데이터를 꺼낸다

In [24]:
print(df)
#loc[행 이름, 열 이름]

df.loc[ : , : ] # 전체 데이터

#특정 데이터 꺼내기
df.loc['둘리', '국어'] # => 60
# 도우너의 수학 점수
df.loc['도우너', '수학'] # =>100

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

np.int64(100)

In [26]:
# [열 이름] => 프레임에서 []를 쓰면, 열만 입력 가능! = 컬럼 이름만 
# 모든 학생의 국어 점수
df['국어']
# 모든 학생의 영어 점수
df['영어']

둘리     70
또치     80
도우너    90
Name: 영어, dtype: int64

## 데이터 프레임에 새로운 열 추가

In [33]:
# 새로운 과목 추가
# 새로운 열 = 리스트
# 맨 뒤에 추가됨
# df['과학'] = [60,70,80]

# 이번엔 2번째 위치에 '미술' 과목을 추가
# insert(위치, 컬럼명, 값 리스트)
#df.insert(2, '미술', [70,80,90])
df

     국어  영어  미술   수학  과학
둘리   60  70  70   80  60
또치   70  80  80   90  70
도우너  80  90  90  100  80

## 데이터 프레임에서 열 삭제
del : 원본에서 바로 삭제  
drop : 원본은 그대로 , 결과만 보여줌

In [42]:
# 과학 과목 삭제
# 선택 => 삭제
#del df['과학']

# 수학 과목 삭제
# drop(형 또는 열의 이름, 방향)
# axis = 1 또는 axis = 'columns'
#result = df.drop('수학', axis = 1) # axis=(축, 방향)
#print(result)
#df
# drop은 원본에 영향이 없다
# 결과를 반영하려면 , 교체( result => df)
#df = df.drop('수학', axis = 1)

# 또치 학생 삭제 (행 삭제)
# axis = 0 또는 axis = 'row'
# drop은 원본에 영향 없음!!
df = df.drop('또치', axis = 0)
df

     국어  영어  미술   수학
둘리   60  70  70   80
도우너  80  90  90  100

## 데이터 프레임 연습문제

### (2번)
과일 판매 데이터를 데이터프레임으로 만들어주세요.  
값은 [[30, 50], [20, 40]]  
행 이름(index)은 ['사과', '배']  
열 이름(columns)은 ['판매량', '재고']  
  
1. 사과의 판매량을 조회하세요. (결과: 30)
2. 새로운 열 '가격'을 추가하고, 사과는 1000원, 배는 1200원으로 입력하세요.

In [45]:
data = np.array([[30,50],[20,40]])
df = pd.DataFrame(data, 
                  index=['사과','배'],
                  columns=['판매량','재고'])
df

    판매량  재고
사과   30  50
배    20  40

In [50]:
# 1.사과의 판매량을 조회하세요. (결과: 30)
df.loc['사과','판매량']

np.int64(30)

In [46]:
# 2.새로운 열 '가격'을 추가하고, 사과는 1000원, 배는 1200원으로 입력하세요.
df['가격'] = [1000,1200]
df

    판매량  재고    가격
사과   30  50  1000
배    20  40  1200

## (3번)
도시 데이터를 데이터프레임으로 만들어주세요.
값은 [[950, 1200], [500, 800]]  
행 이름(index)은 ['서울', '부산']  
열 이름(columns)은 ['인구', '면적']  

1. 서울의 면적을 조회하세요. (결과: 1200)  
2. 새로운 열 '특산물'을 추가하고, 서울은 "김치", 부산은 "어묵"으로 입력하세요.

In [51]:
data = np.array([[950,1200],[500,800]])
df = pd.DataFrame(data, 
                  index=['서울','부산'],
                  columns=['인구','면적'])
df

     인구    면적
서울  950  1200
부산  500   800

In [53]:
# 1.서울의 면적을 조회하세요. (결과: 1200)
df.loc['서울','면적']

np.int64(1200)

In [54]:
# 2.새로운 열 '특산물'을 추가하고, 서울은 "김치", 부산은 "어묵"으로 입력하세요.
df['특산물'] = ['김치','어묵']
df

     인구    면적 특산물
서울  950  1200  김치
부산  500   800  어묵

## (4번)
도서 데이터를 데이터프레임으로 만들어주세요.  
값은 [[15000, '홍길동전'], [20000, '해리포터']]  
행 이름(index)은 ['책1', '책2']  
열 이름(columns)은 ['가격', '제목']  

1. 책2의 가격을 조회하세요. (결과: 20000)  
2. 새로운 열 '저자'를 가격 뒤에 추가하고, 책1은 "허균", 책2는 "J.K. 롤링"으로 입력하세요.

In [68]:
data = np.array([[15000,'홍길동전'],[20000,'해리포터']])
df = pd.DataFrame(data, 
                  index=['책1','책2'],
                  columns=['가격','제목'])
df

       가격    제목
책1  15000  홍길동전
책2  20000  해리포터

In [69]:
# 1.책2의 가격을 조회하세요. (결과: 20000)
# 행, 열 모두 선택시에는 => loc , iloc 사용
df.loc['책2','가격']

'20000'

In [70]:
# 2.새로운 열 '저자'를 가격 뒤에 추가하고, 책1은 "허균", 책2는 "J.K. 롤링"으로 입력하세요
df.insert(1, '저자', ['허균','J.K.롤링'])
df

       가격      저자    제목
책1  15000      허균  홍길동전
책2  20000  J.K.롤링  해리포터

## (5번)
영화 데이터를 데이터프레임으로 만들어주세요.
값은 [[9.0, 14000], [8.2, 9500]]  
행 이름(index)은 ['기생충', '인터스텔라']  
열 이름(columns)은 ['평점', '관객수']  

1. 영화 기생충의 평점을 조회하세요. (결과: 9.0)  
2. '관객수' 열을 삭제하세요.

In [71]:
data = np.array([[9.0,14000],[8.2,9500]])
df = pd.DataFrame(data, 
                  index=['기생충','인터스텔라'],
                  columns=['평점','관객수'])
df

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

In [72]:
# 1.영화 기생충의 평점을 조회하세요. (결과: 9.0)
df.loc['기생충','평점']

np.float64(9.0)

In [74]:
# 2.'관객수' 열을 삭제하세요.
# 1) del 이용 
#del df['관객수']
# 2)result 이용
#result = df.drop('관객수', axis = 1)
#print(result)
#df

        평점
기생충    9.0
인터스텔라  8.2

## 4.3 데이터 계산과 처리

시리즈에서 계산과 조건 검색

In [76]:
# 숫자가 담긴 리스트 생성
lis = [-2,-1,0,1,2]

# 모든 원소에 1만큼 더하기
for i in lis:
    print(i+1)

-1
0
1
2
3

In [75]:
# 숫자가 담긴 시리즈 생성
s = pd.Series([-2,-1,0,1,2])

# 모든 원소에 1만큼 더하기
s + 1
s.add(1)

# => 판다스의 시리즈는 for 없이 반복 수행 가능
# 위의 계산식은 자동으로 더하기가 5번 반복 수행됨

0   -1
1    0
2    1
3    2
4    3
dtype: int64

In [79]:
s
# 조건 검색( 양수만 찾기 )
# 불리언 배열 만들기
# series > int => 시리즈의 전체 데이터와 0을 비교
s > 0
# 불리언 배열은 시리즈의 인덱스로 사용할 수 있다
# true인 값만 남음
s[s > 0]

3    1
4    2
dtype: int64

In [83]:
# 조건 검색2(짝수만 찾기)
s = pd.Series(np.arange(1,11))
s
# 짝수만 찾기 => 0이 나오면 짝수
s % 2 == 0
# bool 배열을 시리즈의 인덱스로 사용
s[s % 2 ==0]

1     2
3     4
5     6
7     8
9    10
dtype: int64

# 시리즈 계산 연습문제

## (1번)
학생 점수 데이터를 시리즈로 만들어주세요.
값은 점수 [80, 90, 75, 85] 이고, 인덱스는 과목 ['국어', '영어', '수학', '과학'] 입니다.

1. 총점을 구하세요.
2. 평균 점수를 구하세요.
3. 가장 높은 점수를 구하세요.
4. 가장 낮은 점수를 구하세요.

In [34]:
s = pd.Series([80,90,75,85],index=['국어', '영어' ,'수학','과학'])
s

국어    80
영어    90
수학    75
과학    85
dtype: int64

In [ ]:
# 자주 사용하는 통계 함수 : sum mean max min
# numpy의 배열, pandas의 시리즈와 데이터 프레임 모두 사용 가능하다

In [100]:
# 1.총점을 구하세요.
print("총점:", s.sum())

총점: 330

In [103]:
# 2.평균 점수를 구하세요.
print("평균:", s.mean())

평균: 82.5

In [101]:
# 3.가장 높은 점수를 구하세요.
print("가장 높은 점수:", s.max())

가장 높은 점수: 90

In [102]:
# 4.가장 낮은 점수를 구하세요.
print("가장 낮은 점수:", s.min())

가장 낮은 점수: 75

## (2번)
일주일 동안의 기온 데이터를 시리즈로 만들어주세요.
값은 기온 [2, 5, -1, 0, 7, -3, 4] 이고, 인덱스는 요일 ['월', '화', '수', '목', '금', '토', '일'] 입니다.

1. 영상(0°C 이상)인 날만 골라내세요.

In [95]:
s = pd.Series([2,5,-1,0,7,-3,4],index=['월', '화' ,'수','목','금','토','일'])
s

월    2
화    5
수   -1
목    0
금    7
토   -3
일    4
dtype: int64

In [97]:
# 1.영상(0°C 이상)인 날만 골라내세요.
s >=0
s[s>=0]

월    2
화    5
목    0
금    7
일    4
dtype: int64

## 데이터 프레임에서 계산과 처리

In [21]:
import numpy as np
import pandas as pd

In [22]:
# 학생 성적 데이터 만들기
data = np.array([[60,70,80],[70,80,90],[80,90,100]])
# 성적 데이터를 담아서 프레임 생성
df = pd.DataFrame(data,  index = ['둘리','또치','도우너'],
                        columns = ['국어','영어','수학'])
df

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

In [110]:
# 국어 과목만 조회
df['국어']
# 국어 과목에 담겨있는 값의 자료형 => int
df['국어'].dtype
# 국어 과목의 자료구조 => series
type(df['국어'])

# => 데이터 프레임은 여러 시리즈의 묶음

pandas.core.series.Series

In [113]:
# 전체 정수에 1점씩 더하기
# 데이터 프레임 전체 데이터에 더하기가 적용됨
df + 1
# 국어 점수만 10점씩 더하기
df['국어'] + 10

둘리     70
또치     80
도우너    90
Name: 국어, dtype: int64

In [116]:
# 조건 검색 ( 국어점수가 70점 이상인 학생만 찾기)
df['국어'] >= 70
# 프레임에 bool 배열을 인덱스로 사용
df[df['국어'] >= 70]

     국어  영어   수학
또치   70  80   90
도우너  80  90  100

## 연습문제

### (1번)
영화 데이터를 데이터프레임으로 만들어주세요.  
값은 [[12000, 9.0], [8000, 8.5], [15000, 9.3]]  
행 이름(index)은 ['기생충', '인터스텔라', '아바타']  
열 이름(columns)은 ['관객수', '평점']  

1. 모든 영화의 관객수에 1000명을 추가하세요.  
(결과: [13000, 9000, 16000])  

2. 평점이 9.0 이상인 영화만 조회하세요.

In [125]:
data = np.array([[12000,9.0],[8000,8.5],[15000,9.3]])
df = pd.DataFrame(data,  index = ['기생충','인터스텔라','아바타'],
                        columns = ['관객수','평점'])
df

           관객수   평점
기생충    12000.0  9.0
인터스텔라   8000.0  8.5
아바타    15000.0  9.3

In [127]:
# 1.모든 영화의 관객수에 1000명을 추가하세요.(결과: [13000, 9000, 16000])
df['관객수'] + 1000

기생충      13000.0
인터스텔라     9000.0
아바타      16000.0
Name: 관객수, dtype: float64

In [128]:
# 2.평점이 9.0 이상인 영화만 조회하세요
df[df['평점'] >= 9.0]

         관객수   평점
기생충  12000.0  9.0
아바타  15000.0  9.3

### (2번)
상품 매출 데이터를 데이터프레임으로 만들어주세요.  
값: [[25000, 30000], [40000, 15000]]  
행 이름(index): [‘치마', '바지']  
열 이름(columns): ['1월 매출', ‘2월 매출']  

1. 새로운 열 '합계'를 추가하여 1월과 2월 매출의 합을 구하세요.  
2. '합계'를 만원 단위로 바꾼 새로운 열 '합계(만원)'을 추가하세요.

In [129]:
data = np.array([[25000,30000],[40000,15000]])
df = pd.DataFrame(data,  index = ['치마','바지'],
                        columns = ['1월 매출','2월 매출'])
df

    1월 매출  2월 매출
치마  25000  30000
바지  40000  15000

In [133]:
# 1.새로운 열 '합계'를 추가하여 1월과 2월 매출의 합을 구하세요.
df['합계'] = df['1월 매출'] + df['2월 매출']
df

    1월 매출  2월 매출     합계
치마  25000  30000  55000
바지  40000  15000  55000

In [134]:
# 2.'합계'를 만원 단위로 바꾼 새로운 열 '합계(만원)'을 추가하세요
df['합계(만원)'] = df['합계'] / 10000
df

    1월 매출  2월 매출     합계  합계(만원)
치마  25000  30000  55000     5.5
바지  40000  15000  55000     5.5

## 데이터 프레임의 정렬
시험 성적 순위를 매길때 사용

In [25]:
# 시험 성적에서 국어 점수를 기준으로 정렬
# df.sort_values('국어')
# 국어 점수를 기준으로 내림차순 정렬
# 정렬기준 : 오름차순(1->10)/ 내림차순(10->1)
# ascending: 오름차순(true)/ 내림차순(false)
# df.sort_values('국어', ascending=false)

In [33]:
# 랜덤함수로 시험 점수 생성
# 범위 : 60~100점
# 개수 : 9개
data = np.random.randint(60,100,9)
# 3행 3열 크기의 2차원 배열로 변환
arr = data.reshape(3,3)
print(arr)

# 프레임 생성
df = pd.DataFrame(arr, index = ['둘리','또치','도우너'], 
                  columns =['수학','영어','과학'])
print(df)
# 영어 점수가 높은 사람 순으로 정렬
df.sort_values('영어', ascending=False)

[[86 99 95]
 [88 86 63]
 [75 94 60]]
     수학  영어  과학
둘리   86  99  95
또치   88  86  63
도우너  75  94  60

     수학  영어  과학
둘리   86  99  95
도우너  75  94  60
또치   88  86  63

## nan 처리  
누락된 값, 빈값  
예를 들어 엑셀에서 빈셀을 표현할 때 사용  
nan은 float 타입에서만 표현 가능

In [35]:
df

     수학  영어  과학
둘리   86  99  95
또치   88  86  63
도우너  75  94  60

In [39]:
# 둘리의 영어점수를 빈값(nan)으로 표시
# 빈값을 넣으면 해당 값이 들어간 열이 => float 타입으로 자동 형변환됨
# df.loc['둘리','영어'] = np.nan # =>예약어 사용
df

     수학    영어  과학
둘리   86   NaN  95
또치   88  86.0  63
도우너  75  94.0  60

In [41]:
# 점수가 없는 학생 데이터 삭제
# 빈값이 있는 행 삭제
# axis 0 'row' =>행
df = df.dropna(axis=0) # => dropna도 원본에는 영향 없음 => 결과를 df에 덮어씌우기
df

     수학    영어  과학
또치   88  86.0  63
도우너  75  94.0  60

In [43]:
# 또치의 과학 점수를 반값으로 설정
df.loc['또치','과학'] = np.nan
df

     수학    영어    과학
또치   88  86.0   NaN
도우너  75  94.0  60.0

In [44]:
# 비어있는 점수를 모두 0으로 설정
df.fillna(0)

     수학    영어    과학
또치   88  86.0   0.0
도우너  75  94.0  60.0

## (1번)
도시별 기온 데이터를 데이터 프레임으로 만들어 주세요.  
데이터: [[20, 25, 15], [18, 22, 19], [25, 27, 23]]  
행 이름(index): ['서울', '부산', '대구']  
열 이름(columns): ['봄', '여름', '겨울']  

1. 서울의 여름 기온을 빈값(NaN) 으로 변경하세요.  
2. 빈값이 포함된 행을 삭제 하세요.  
3. 부산의 봄 기온을 빈값(NaN) 으로 변경하세요.  
4. 모든 빈값을 0으로 채우세요.

In [45]:
data = np.array([[20,25,15],[18,22,19],[25,27,23]])
df = pd.DataFrame(data,  index = ['서울','부산','대구'],
                        columns = ['봄','여름','겨울'])
df

     봄  여름  겨울
서울  20  25  15
부산  18  22  19
대구  25  27  23

In [46]:
# 1.서울의 여름 기온을 빈값(NaN) 으로 변경하세요.
df.loc['서울','여름'] = np.nan
df

     봄    여름  겨울
서울  20   NaN  15
부산  18  22.0  19
대구  25  27.0  23

In [48]:
# 2.빈값이 포함된 행을 삭제 하세요.
df = df.dropna(axis=0)
df

     봄    여름  겨울
부산  18  22.0  19
대구  25  27.0  23

In [49]:
# 3.부산의 봄 기온을 빈값(NaN) 으로 변경하세요
df.loc['부산','봄'] = np.nan
df

       봄    여름  겨울
부산   NaN  22.0  19
대구  25.0  27.0  23

In [50]:
# 4.모든 빈값을 0으로 채우세요.
df.fillna(0)

       봄    여름  겨울
부산   0.0  22.0  19
대구  25.0  27.0  23

## (2번)
학급별 점수 데이터를 데이터프레임으로 만드세요.   
데이터: [[80, 75, 90], [85, 88, 82], [70, 65, 78]]  
행 이름(index): ['국어', '영어', '수학']  
열 이름(columns): ['1반', '2반', '3반']  

1. 2반 영어 점수를 빈값(NaN) 으로 변경하세요.  
2. 빈값이 포함된 열을 삭제하세요.  
3. 3반 수학 점수를 빈값(NaN) 으로 변경하세요.  
4. 모든 빈값을 100으로 채우세요.

In [56]:
data = np.array([[80,75,90],[85,88,82],[70,65,78]])
df = pd.DataFrame(data,  index = ['국어','영어','수학'],
                        columns = ['1반','2반','3반'])
df

    1반  2반  3반
국어  80  75  90
영어  85  88  82
수학  70  65  78

In [57]:
# 1.2반 영어 점수를 빈값(NaN) 으로 변경하세요.
df.loc['영어','2반'] = np.nan
df

    1반    2반  3반
국어  80  75.0  90
영어  85   NaN  82
수학  70  65.0  78

In [58]:
# 2.빈값이 포함된 열을 삭제하세요.
# axis = 0 행
# axis = 1 열
df = df.dropna(axis=1)
df

    1반  3반
국어  80  90
영어  85  82
수학  70  78

In [59]:
# 3.3반 수학 점수를 빈값(NaN) 으로 변경하세요.
df.loc['수학','3반'] = np.nan
df

    1반    3반
국어  80  90.0
영어  85  82.0
수학  70   NaN

In [60]:
# 4.모든 빈값을 100으로 채우세요.
df.fillna(100)

    1반     3반
국어  80   90.0
영어  85   82.0
수학  70  100.0

## 4.4 데이터 탐색  
데이터의 상태나 특징을 파악하는 작업

In [2]:
# 과일 목록을 담은 시리즈 생성 
# 시리즈 : 인덱스를 가지고 있는 한줄짜리 데이터
s = pd.Series(['사과','배','사과','배','바나나'])
s

0     사과
1      배
2     사과
3      배
4    바나나
dtype: object

In [3]:
# 중복을 제거하고 유니크한 값만 남기기
s.unique()

array(['사과', '배', '바나나'], dtype=object)

In [4]:
# 원소별 개수 세기
s.value_counts()

사과     2
배      2
바나나    1
Name: count, dtype: int64

## 연습문제

### 문제1)  
지역 목록을 시리즈로 만들어주세요  
값은 ['서울','부산','서울','대구','부산','광주','서울']입니다  

중복을 제거한 데이터만 출력하세요  
결과 :['서울','부산','대구','광주']  

각 도시가 몇번 나왔는지 출력하세요  
결과 : 서울 : 3, 부산 :2 , 대구 : 1, 광주 : 1

In [5]:
# 지역 목록을 시리즈로 만들어주세요
# 값은 ['서울','부산','서울','대구','부산','광주','서울']입니다

s = pd.Series(['서울','부산','서울','대구','부산','광주','서울'])
s

0    서울
1    부산
2    서울
3    대구
4    부산
5    광주
6    서울
dtype: object

In [6]:
# 중복을 제거한 데이터만 출력하세요 => 결과 :['서울','부산','대구','광주']
s.unique()

array(['서울', '부산', '대구', '광주'], dtype=object)

In [7]:
# 각 도시가 몇번 나왔는지 출력하세요 => 결과 : 서울 : 3, 부산 :2 , 대구 : 1, 광주 : 1
s.value_counts()

서울    3
부산    2
대구    1
광주    1
Name: count, dtype: int64

## 문제2)
이름 목록을 시리즈로 만들어 주세요  
값은 ['민수','지연','철수','민수','영희','민수','지연'] 

가장 많이 나온 이름의 수를 출력하세요(결과 : 3)

In [8]:
# 이름 목록을 시리즈로 만들어 주세요
# 값은 ['민수','지연','철수','민수','영희','민수','지연']

s = pd.Series(['민수','지연','철수','민수','영희','민수','지연'])
s

0    민수
1    지연
2    철수
3    민수
4    영희
5    민수
6    지연
dtype: object

In [14]:
# 가장 많이 나온 이름의 수를 출력하세요(결과 : 3)
result = s.value_counts()
type(result)
result.max()

np.int64(3)

In [ ]:
# 판다스의 series는 통계함수 사용할 수 있다
# sum, mean, max, min